wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_edim_biss.c
                EDIM_BISS_SnPDTCFG(cnt_slave) = reg_tmp;
            }
        }
        for(; cnt_slave < MAX_SLVAE_NUMER; cnt_slave++) {
            EDIM_BISS_SnPDTCFG(cnt_slave) = 0U;
        }
    }
}

/*!
    \brief      enable specified BiSS-C slave (API_ID(0x0005U))
    \param[in]  slave: the slave to be enable
                one or more parameter can be selected which is shown as below:
      \arg        EDIM_BISS_SLAVE0: slave id 0
      \arg        EDIM_BISS_SLAVE1: slave id 1
      \arg        EDIM_BISS_SLAVE2: slave id 2
      \arg        EDIM_BISS_SLAVE3: slave id 3
      \arg        EDIM_BISS_SLAVE4: slave id 4
      \arg        EDIM_BISS_SLAVE5: slave id 5
      \arg        EDIM_BISS_SLAVE6: slave id 6
      \arg        EDIM_BISS_SLAVE7: slave id 7
      \arg        EDIM_BISS_ALLSLAVE: all slaves
    \param[out] none
    \retval     none
*/
void edim_biss_slave_enable(uint32_t slave)
{
    uint32_t cnt_slave = 0U;
    for(cnt_slave = 0U; cnt_slave < MAX_SLVAE_NUMER; cnt_slave++) {
        if(0U != (slave & (1U << cnt_slave))) {
            EDIM_BISS_SnPDTCFG(cnt_slave) |= EDIM_BISS_SnPDTCFG_PDTEN;
        }
    }
}

/*!
    \brief      disable specified BiSS-C slave (API_ID(0x0006U))
    \param[in]  slave: the slave to be enable
                one or more parameter can be selected which is shown as below:
      \arg        EDIM_BISS_SLAVE0: slave id 0
      \arg        EDIM_BISS_SLAVE1: slave id 1
      \arg        EDIM_BISS_SLAVE2: slave id 2
      \arg        EDIM_BISS_SLAVE3: slave id 3
      \arg        EDIM_BISS_SLAVE4: slave id 4
      \arg        EDIM_BISS_SLAVE5: slave id 5
      \arg        EDIM_BISS_SLAVE6: slave id 6
      \arg        EDIM_BISS_SLAVE7: slave id 7
      \arg        EDIM_BISS_ALLSLAVE: all slaves
    \param[out] none
    \retval     none
*/
void edim_biss_slave_disable(uint32_t slave)
{
    uint32_t cnt_slave = 0U;
    for(cnt_slave = 0U; cnt_slave < MAX_SLVAE_NUMER; cnt_slave++) {
        if(0U != (slave & (1U << cnt_slave))) {
            EDIM_BISS_SnPDTCFG(cnt_slave) &= (~EDIM_BISS_SnPDTCFG_PDTEN);
        }
    }
}

/*!
    \brief      send BiSS-C initialization sequence (API_ID(0x0007U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_biss_initialization_sequence_config(EventStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_BISS_CCFG2 |= EDIM_BISS_CCFG2_TINIT;
    } else {
        EDIM_BISS_CCFG2 &= (~EDIM_BISS_CCFG2_TINIT);
    }
}

/*!
    \brief      stop current BiSS-C communication (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_biss_break(void)
{
    EDIM_BISS_CCFG2 |= EDIM_BISS_CCFG2_BRKDT;
}

/*!
    \brief      configure BiSS-C register communication to be sent (API_ID(0x0009U))
    \param[in]  edim_biss_control_comm_struct: control communication content
                  reg_r_w: register communication mode,
                           EDIM_BISS_CCOMM_REG_READ, EDIM_BISS_CCOMM_REG_WRITE
                  slave_id: slave id to be access, 0~7
                  reg_addr: register start address, 0~0x7F
                  r_w_data: context arrary to be sent (when reg_r_w = EDIM_BISS_CCOMM_REG_WRITE),
                            r_w_data[] = 0, (don't care when reg_r_w = EDIM_BISS_CCOMM_REG_READ),
                  reg_n_byte: number of byte to be access, 1~64
    \param[out] none
    \retval     none
*/
void edim_biss_reg_access(edim_biss_control_comm_struct *ctrl_comm_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ctrl_comm_struct)) {
        fw_debug_report_err(EDIM_BISS_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(ctrl_comm_struct->r_w_data)) {
        fw_debug_report_err(EDIM_BISS_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg_tmp;
        uint32_t reg_cnt;
        uint32_t reg_cnt_loop4;
        uint32_t reg_cnt_ccdata;

        reg_tmp = ((ctrl_comm_struct->reg_r_w & EDIM_BISS_CCFG0_REGWRSEL) |
                   CTLCOMMCFG0_REGADDR(ctrl_comm_struct->reg_addr) |
                   CTLCOMMCFG0_REGNUM(ctrl_comm_struct->reg_n_byte - 1U));
        EDIM_BISS_CCFG0 = reg_tmp;

        reg_tmp = EDIM_BISS_CCFG1;
        reg_tmp &= (~(EDIM_BISS_CCFG1_CTS | EDIM_BISS_CCFG1_CMD));
        reg_tmp |= (EDIM_BISS_CCFG1_CTS |
                    CTLCOMMCFG1_SLAVEID(ctrl_comm_struct->slave_id));
        EDIM_BISS_CCFG1 = reg_tmp;

        reg_tmp = 0U;
        if(EDIM_BISS_CCOMM_REG_WRITE == ctrl_comm_struct->reg_r_w) {
            for(reg_cnt_ccdata = 0U; reg_cnt_ccdata < 16U; reg_cnt_ccdata++) {
                EDIM_BISS_CCDATAx(reg_cnt_ccdata) = 0U;
            }
            for(reg_cnt = 0U; reg_cnt < ctrl_comm_struct->reg_n_byte; reg_cnt++) {
                reg_cnt_loop4 = reg_cnt % 4U;
                reg_tmp |= (uint32_t)((uint32_t)(ctrl_comm_struct->r_w_data[reg_cnt]) << (reg_cnt_loop4 * 8U));
                if(3U == reg_cnt_loop4) {
                    EDIM_BISS_CCDATAx((reg_cnt / 4U)) = reg_tmp;
                    reg_tmp = 0U;
                }
            }

            if(3U != reg_cnt_loop4) {
                EDIM_BISS_CCDATAx((reg_cnt / 4U)) = reg_tmp;
            }
        }
    }
}

/*!
    \brief      configure BiSS-C command communication to be sent (API_ID(0x000AU))
    \param[in]  slave_id: slave id to be access,
                when using BiSS Command frame, one or more parameter can be selected which is shown as below:
      \arg        EDIM_BISS_SLAVE0: slave id 0
      \arg        EDIM_BISS_SLAVE1: slave id 1
      \arg        EDIM_BISS_SLAVE2: slave id 2
      \arg        EDIM_BISS_SLAVE3: slave id 3
      \arg        EDIM_BISS_SLAVE4: slave id 4
      \arg        EDIM_BISS_SLAVE5: slave id 5
      \arg        EDIM_BISS_SLAVE6: slave id 6
      \arg        EDIM_BISS_SLAVE7: slave id 7
      \arg        EDIM_BISS_ALLSLAVE: all slaves
                when using broadcast BiSS command frame, only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_SLAVE_BROADCAST: broadcast slaves
    \param[in]  cmd_value: slave command,
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_CMD_CHECKIDA(cmd): after successful checking of the ID acknowledge bit, send BiSS command frame, cmd = 0~3
      \arg        EDIM_BISS_CMD_ALWAYSEXE(cmd): send BiSS command frame without IDA check, cmd = 0~3
    \param[out] none
    \retval     none
*/
void edim_biss_command(uint32_t slave_id, uint32_t cmd_value)
{
    uint32_t reg_tmp;

    reg_tmp = EDIM_BISS_CCFG1;
    reg_tmp &= (~(EDIM_BISS_CCFG1_CTS | EDIM_BISS_CCFG1_CMD));
    reg_tmp |= (cmd_value & EDIM_BISS_CCFG1_CMD);
    EDIM_BISS_CCFG1 = reg_tmp;

    EDIM_BISS_CCDATAx(0U) = slave_id;
}

/*!
    \brief      start a new BiSS-C frame with specified mode (API_ID(0x000BU))
    \param[in]  frame_config: slave id to be access,
                only one parameter can be selected which is shown as below:
      \arg        EDIM_BISS_STOP: no further frame will be sent
      \arg        EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_1: it will send one frame with CDM = 1
      \arg        EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_0: it will send one frame with CDM = 0
      \arg        EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_INVERSE_CDS: it will send one frame with CDM equal to inversed CDS
      \arg        EDIM_BISS_SEND_SINGLE_CTRL_FRAME: it will send one frame with control communication
      \arg        EDIM_BISS_SEND_SINGLE_CTRL_REDUCED_FRAME: it will send a reduced frame with control communication
      \arg        EDIM_BISS_SEND_AUTO_DATA_FRAME_WITH_CDM_1: it will send frame with CDM = 1 in ADT mode
      \arg        EDIM_BISS_SEND_AUTO_DATA_FRAME_WITH_CDM_0: it will send frame with CDM = 0 in ADT mode
      \arg        EDIM_BISS_SEND_AUTO_DATA_FRAME_WITH_CDM_INVERSE_CDS: it will send frame with CDM equal to inversed CDS in ADT mode
      \arg        EDIM_BISS_SEND_AUTO_CTRL_FRAME: it will send frame with control communication in ADT mode
      \arg        EDIM_BISS_SEND_AUTO_CTRL_REDUCED_FRAME: it will send reduced frame with control communication in ADT mode
    \param[out] none
    \retval     none
*/
void edim_biss_send_frame(uint32_t frame_config)
{
    uint32_t reg_tmp;

